#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

module.TestReady.heroku_domain.testready: Refreshing state... [id=85ace6e0-3c7a-4691-a997-ca35e1960b1b]
module.LuaLepAPI.heroku_app.lualep: Refreshing state... [id=lua-lep-api]
module.TestReady.cloudflare_record.www_testready: Refreshing state... [id=f6c9a4e7941a8e864238a3cceadd1cef]
module.TestReady.heroku_domain.www_testready: Refreshing state... [id=20b6df00-695c-49e6-9006-555e5a42b3d3]
module.TestReady.heroku_app.testready: Refreshing state... [id=testready-megatunger]
module.BinhMinhERP.cloudflare_record.binhminh_erp_sendgrid_1: Refreshing state... [id=3582aff137e0b139f4a62723944643ef]
module.BinhMinhIdCardAPI.heroku_app.bmidcard_api: Refreshing state... [id=binhminh-idcard-api]
module.BinhMinhERP.cloudflare_record.binhminh_erp_sendgrid_5: Refreshing state... [id=b6758c86fbd62dec46e0ad573d11fbc4]
module.BinhMinhERP.cloudflare_record.binhminh_erp_sendgrid_4: Refreshing state... [id=b4f9e88334045a0e35152b58812bb713]
module.BinhMinhERP.cloudflare_record.binhminh_erp_sendgrid_3: Refreshing state... [id=c637dde6b0a6ca0b95a9290488db1e4f]
module.BinhMinhERP.cloudflare_record.binhminh_erp_sendgrid_2: Refreshing state... [id=a5375d4fa013a7250d1f22dd5cb23e47]
module.GithubPages.cloudflare_record.megatunger: Refreshing state... [id=f0f3d3dd10b56526384f3b716e07f8dd]
module.BinhMinhIdCardAPI.cloudflare_record.bmidcard_api: Refreshing state... [id=6e9cfbacb5fa5c433735b7be41fee631]
module.TestReady.cloudflare_record.testready: Refreshing state... [id=633b4e558148faceea66d6e1d5880876]
module.GithubPages.cloudflare_record.www_megatunger: Refreshing state... [id=ec1036d9e53f9deb9762329c6a490b62]
module.LuaLepAPI.cloudflare_record.lualep: Refreshing state... [id=d9e619af5ed3a3229b73c1179bd37a77]
module.TestReady.heroku_addon.database: Refreshing state... [id=3a3dfb0f-7372-439c-9263-4906fbd57f43]
module.TestReady.heroku_build.testready: Refreshing state... [id=7f8dabbc-8eba-4464-b65d-f31f0fa43c9c]
module.TestReady.heroku_addon.redis: Refreshing state... [id=36d41931-c9a0-4941-89b3-2a1e085d695a]
module.BinhMinhIdCardAPI.heroku_build.bmidcard_api: Refreshing state... [id=ecb8f54e-69c9-4342-b1d8-e6c6d03f0796]
module.LuaLepAPI.heroku_build.lualep: Refreshing state... [id=8f168cb6-c51e-4f6a-a8d0-2594681b7c16]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.SolveX.cloudflare_record.solvex will be created
  + resource "cloudflare_record" "solvex" {
      + created_on  = (known after apply)
      + hostname    = (known after apply)
      + id          = (known after apply)
      + metadata    = (known after apply)
      + modified_on = (known after apply)
      + name        = "solvex"
      + proxiable   = (known after apply)
      + proxied     = true
      + ttl         = (known after apply)
      + type        = "CNAME"
      + value       = "solve-x.herokuapp.com"
      + zone_id     = "aca3b9abd9599c415584a6502e83bad2"
    }

  # module.SolveX.cloudflare_record.www_solvex will be created
  + resource "cloudflare_record" "www_solvex" {
      + created_on  = (known after apply)
      + hostname    = (known after apply)
      + id          = (known after apply)
      + metadata    = (known after apply)
      + modified_on = (known after apply)
      + name        = "www.solvex"
      + proxiable   = (known after apply)
      + proxied     = true
      + ttl         = (known after apply)
      + type        = "CNAME"
      + value       = "solve-x.herokuapp.com"
      + zone_id     = "aca3b9abd9599c415584a6502e83bad2"
    }

  # module.SolveX.heroku_addon.database will be created
  + resource "heroku_addon" "database" {
      + app         = (known after apply)
      + config_vars = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + plan        = "heroku-postgresql:hobby-dev"
      + provider_id = (known after apply)
    }

  # module.SolveX.heroku_addon.redis will be created
  + resource "heroku_addon" "redis" {
      + app         = (known after apply)
      + config_vars = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + plan        = "heroku-redis:hobby-dev"
      + provider_id = (known after apply)
    }

  # module.SolveX.heroku_app.solvex will be created
  + resource "heroku_app" "solvex" {
      + acm                   = (known after apply)
      + all_config_vars       = (sensitive value)
      + buildpacks            = (known after apply)
      + config_vars           = (known after apply)
      + git_url               = (known after apply)
      + heroku_hostname       = (known after apply)
      + id                    = (known after apply)
      + internal_routing      = (known after apply)
      + name                  = "solve-x"
      + region                = "eu"
      + sensitive_config_vars = (sensitive value)
      + stack                 = (known after apply)
      + uuid                  = (known after apply)
      + web_url               = (known after apply)
    }

  # module.SolveX.heroku_build.solvex will be created
  + resource "heroku_build" "solvex" {
      + app               = (known after apply)
      + buildpacks        = [
          + "https://github.com/heroku/heroku-buildpack-ruby.git",
          + "https://github.com/heroku/heroku-buildpack-activestorage-preview",
        ]
      + id                = (known after apply)
      + local_checksum    = (known after apply)
      + output_stream_url = (known after apply)
      + release_id        = (known after apply)
      + slug_id           = (known after apply)
      + source            = {
          + "url" = "https://api.github.com/repos/megatunger/OdingsProject/tarball?access_token=2979285c8a761ceeac7728268f8c4f82ebe372e0"
        }
      + stack             = (known after apply)
      + status            = (known after apply)
      + user              = (known after apply)
      + uuid              = (known after apply)
    }

  # module.SolveX.heroku_config.solvex will be created
  + resource "heroku_config" "solvex" {
      + id             = (known after apply)
      + sensitive_vars = (sensitive value)
    }

  # module.TestReady.heroku_domain.testready will be destroyed
  - resource "heroku_domain" "testready" {
      - app      = "testready-megatunger" -> null
      - cname    = "serene-fish-lgfjy72zj2sv9zuwgj0g7gw5.herokudns.com" -> null
      - hostname = "testready.megatunger.com" -> null
      - id       = "85ace6e0-3c7a-4691-a997-ca35e1960b1b" -> null
    }

  # module.TestReady.heroku_domain.www_testready will be destroyed
  - resource "heroku_domain" "www_testready" {
      - app      = "testready-megatunger" -> null
      - cname    = "philosophical-catshark-qks1auzzl2p3a02iqd3szfjj.herokudns.com" -> null
      - hostname = "www.testready.megatunger.com" -> null
      - id       = "20b6df00-695c-49e6-9006-555e5a42b3d3" -> null
    }

Plan: 7 to add, 0 to change, 2 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```
</details>
*Pusher: @megatunger, Action: `pull_request`*